{"loss": "categorical_crossentropy", "optimizer": {"epsilon": 1e-08, "lr": 0.009999999776482582, "name": "Adagrad"}, "class_name": "Sequential", "keras_version": "1.0.5", "config": [{"class_name": "GRU", "config": {"U_regularizer": null, "name": "gru_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 512, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": true, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dtype": "float32", "return_sequences": true, "batch_input_shape": [672, 1, 3716], "W_regularizer": null, "activation": "tanh", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": "0.5", "trainable": true, "name": "dropout_1"}}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "gru_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 512, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": true, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dtype": "float32", "return_sequences": false, "batch_input_shape": [672, 1, 512], "W_regularizer": null, "activation": "tanh", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": "0.5", "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 3716}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}], "sample_weight_mode": null}